vachernov/STM32-Steppers-Lib/examples/hbot/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

/* Steppers */

#define M1_STEP_Pin GPIO_PIN_4
#define M1_STEP_GPIO_Port GPIOB
#define M1_DIR_Pin GPIO_PIN_5
#define M1_DIR_GPIO_Port GPIOB
#define M1_ENABLE_Pin GPIO_PIN_10
#define M1_ENABLE_GPIO_Port GPIOB

#define M2_STEP_Pin GPIO_PIN_0
#define M2_STEP_GPIO_Port GPIOB
#define M2_DIR_Pin GPIO_PIN_1
#define M2_DIR_GPIO_Port GPIOB
#define M2_ENABLE_Pin GPIO_PIN_2
#define M2_ENABLE_GPIO_Port GPIOB

#define M3_STEP_Pin GPIO_PIN_6
#define M3_STEP_GPIO_Port GPIOB
#define M3_DIR_Pin GPIO_PIN_7
#define M3_DIR_GPIO_Port GPIOB
#define M3_ENABLE_Pin GPIO_PIN_8
#define M3_ENABLE_GPIO_Port GPIOB

/* Litim switches */

#define SWITCH_X_MIN_Pin GPIO_PIN_0
#define SWITCH_X_MIN_GPIO_Port GPIOC
#define SWITCH_X_MAX_Pin GPIO_PIN_1
#define SWITCH_X_MAX_GPIO_Port GPIOC
#define SWITCH_Y_MIN_Pin GPIO_PIN_2
#define SWITCH_Y_MIN_GPIO_Port GPIOC
#define SWITCH_Y_MAX_Pin GPIO_PIN_3
#define SWITCH_Y_MAX_GPIO_Port GPIOC
#define SWITCH_Z_MIN_Pin GPIO_PIN_6
#define SWITCH_Z_MIN_GPIO_Port GPIOC
#define SWITCH_Z_MAX_Pin GPIO_PIN_7
#define SWITCH_Z_MAX_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
